# Pandas
* filtering
* sorting
* usefull methods
* groupby
* merge

In [1]:
import pandas as pd
from datetime import datetime

# Define the data as a list of dictionaries with 10 student records
students_data = [
    {'roll_no': 1, 'name': 'Alice', 'father': 'Bob', 'course': 'Physics', 'date_of_admission': '2023-01-10', 'fee': 10000},
    {'roll_no': 2, 'name': 'Brian', 'father': 'Steve', 'course': 'Chemistry', 'date_of_admission': '2023-02-12', 'fee': 11000},
    {'roll_no': 3, 'name': 'Chloe', 'father': 'Tim', 'course': 'Biology', 'date_of_admission': '2023-03-14', 'fee': 12000},
    {'roll_no': 4, 'name': 'David', 'father': 'Rick', 'course': 'Mathematics', 'date_of_admission': '2023-04-10', 'fee': 13000},
    {'roll_no': 5, 'name': 'Eva', 'father': 'John', 'course': 'Computer Science', 'date_of_admission': '2023-05-16', 'fee': 14000},
    {'roll_no': 6, 'name': 'Frank', 'father': 'Tom', 'course': 'Economics', 'date_of_admission': '2023-06-21', 'fee': 15000},
    {'roll_no': 7, 'name': 'Grace', 'father': 'Harry', 'course': 'History', 'date_of_admission': '2023-07-25', 'fee': 16000},
    {'roll_no': 8, 'name': 'Henry', 'father': 'Charles', 'course': 'Geography', 'date_of_admission': '2023-08-17', 'fee': 17000},
    {'roll_no': 9, 'name': 'Isabel', 'father': 'Oliver', 'course': 'English', 'date_of_admission': '2023-09-10', 'fee': 18000},
    {'roll_no': 10, 'name': 'Jack', 'father': 'Noah', 'course': 'Art', 'date_of_admission': '2023-10-05', 'fee': 19000},
]

# Create the DataFrame
students_df : pd.DataFrame = pd.DataFrame(students_data)

# Convert 'date_of_admission' to datetime
students_df['date_of_admission'] = pd.to_datetime(students_df['date_of_admission'])

# Show the DataFrame
display(students_df)

# Verify the data types
display(students_df.info())

   roll_no    name   father            course date_of_admission    fee
0        1   Alice      Bob           Physics        2023-01-10  10000
1        2   Brian    Steve         Chemistry        2023-02-12  11000
2        3   Chloe      Tim           Biology        2023-03-14  12000
3        4   David     Rick       Mathematics        2023-04-10  13000
4        5     Eva     John  Computer Science        2023-05-16  14000
5        6   Frank      Tom         Economics        2023-06-21  15000
6        7   Grace    Harry           History        2023-07-25  16000
7        8   Henry  Charles         Geography        2023-08-17  17000
8        9  Isabel   Oliver           English        2023-09-10  18000
9       10    Jack     Noah               Art        2023-10-05  19000

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   roll_no            10 non-null     int64
 1   name               10 non-null     object
 2   father             10 non-null     object
 3   course             10 non-null     object
 4   date_of_admission  10 non-null     datetime64[ns]
 5   fee                10 non-null     int64
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 612.0+ bytes

None

In [4]:
import pandera as pa
from pandera.typing import Series
from datetime import datetime
import pandas as pd

# Define the schema using DataFrameModel
class StudentSchema(pa.DataFrameModel):
    roll_no: Series[int] = pa.Field(ge=1)
    name: Series[str] = pa.Field(nullable=False)
    father: Series[str] = pa.Field(nullable=False)
    course: Series[str] = pa.Field(nullable=False)
    date_of_admission: Series[datetime] = pa.Field(le=datetime.now())
    fee: Series[int] = pa.Field(ge=0)

    class Config:
        coerce = True  # Automatically coerce types if possible
        strict = True  # Ensure all columns are accounted for in the schema

# Data for 10 students
students_data = [
    {'roll_no': 1, 'name': 'Alice', 'father': 'Bob', 'course': 'Physics', 'date_of_admission': '2023-01-10', 'fee': 10000},
    {'roll_no': 2, 'name': 'Brian', 'father': 'Steve', 'course': 'Chemistry', 'date_of_admission': '2023-02-12', 'fee': 11000},
    {'roll_no': 3, 'name': 'Chloe', 'father': 'Tim', 'course': 'Biology', 'date_of_admission': '2023-03-14', 'fee': 12000},
    {'roll_no': 4, 'name': 'David', 'father': 'Rick', 'course': 'Physics', 'date_of_admission': '2023-04-10', 'fee': 13000},
    {'roll_no': 5, 'name': 'Eva', 'father': 'John', 'course': 'Physics', 'date_of_admission': '2023-05-16', 'fee': 14000},
    {'roll_no': 6, 'name': 'Frank', 'father': 'Tom', 'course': 'Economics', 'date_of_admission': '2023-06-21', 'fee': 15000},
    {'roll_no': 7, 'name': 'Grace', 'father': 'Harry', 'course': 'History', 'date_of_admission': '2023-07-25', 'fee': 16000},
    {'roll_no': 8, 'name': 'Henry', 'father': 'Charles', 'course': 'Geography', 'date_of_admission': '2023-08-17', 'fee': 17000},
    {'roll_no': 9, 'name': 'Isabel', 'father': 'Oliver', 'course': 'English', 'date_of_admission': '2023-09-10', 'fee': 18000},
    {'roll_no': 10, 'name': 'Jack', 'father': 'Noah', 'course': 'Art', 'date_of_admission': '2023-10-05', 'fee': 19000},
]

# Create the DataFrame
students_df = pd.DataFrame(students_data)

# Convert 'date_of_admission' to datetime
students_df['date_of_admission'] = pd.to_datetime(students_df['date_of_admission'])

# Validate the DataFrame
validated_df = StudentSchema.validate(students_df)

# Print the validated DataFrame
print(validated_df)

   roll_no    name   father     course date_of_admission    fee
0        1   Alice      Bob    Physics        2023-01-10  10000
1        2   Brian    Steve  Chemistry        2023-02-12  11000
2        3   Chloe      Tim    Biology        2023-03-14  12000
3        4   David     Rick    Physics        2023-04-10  13000
4        5     Eva     John    Physics        2023-05-16  14000
5        6   Frank      Tom  Economics        2023-06-21  15000
6        7   Grace    Harry    History        2023-07-25  16000
7        8   Henry  Charles  Geography        2023-08-17  17000
8        9  Isabel   Oliver    English        2023-09-10  18000
9       10    Jack     Noah        Art        2023-10-05  19000

## apply the filter or filter functions on dataframe

In [6]:
students_df.head(1)

   roll_no   name father   course date_of_admission    fee
0        1  Alice    Bob  Physics        2023-01-10  10000

In [8]:
students_df.course.value_counts() # we have 3 three students which selected physics

course
Physics      3
Chemistry    1
Biology      1
Economics    1
History      1
Geography    1
English      1
Art          1
Name: count, dtype: int64

In [10]:
students_df.course.value_counts(dropna=False)# also counts null cells values, but here we don't have any null cell

course
Physics      3
Chemistry    1
Biology      1
Economics    1
History      1
Geography    1
English      1
Art          1
Name: count, dtype: int64

In [11]:
students_df.course.value_counts(dropna=False,normalize=True)# convert into percentage by / 100

course
Physics      0.3
Chemistry    0.1
Biology      0.1
Economics    0.1
History      0.1
Geography    0.1
English      0.1
Art          0.1
Name: proportion, dtype: float64

In [12]:
students_df.course.value_counts(dropna=False,normalize=True)*100# also counts null cells values

course
Physics      30.0
Chemistry    10.0
Biology      10.0
Economics    10.0
History      10.0
Geography    10.0
English      10.0
Art          10.0
Name: proportion, dtype: float64

In [13]:
students_df

   roll_no    name   father     course date_of_admission    fee
0        1   Alice      Bob    Physics        2023-01-10  10000
1        2   Brian    Steve  Chemistry        2023-02-12  11000
2        3   Chloe      Tim    Biology        2023-03-14  12000
3        4   David     Rick    Physics        2023-04-10  13000
4        5     Eva     John    Physics        2023-05-16  14000
5        6   Frank      Tom  Economics        2023-06-21  15000
6        7   Grace    Harry    History        2023-07-25  16000
7        8   Henry  Charles  Geography        2023-08-17  17000
8        9  Isabel   Oliver    English        2023-09-10  18000
9       10    Jack     Noah        Art        2023-10-05  19000

In [14]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta

# Set a seed for reproducibility
np.random.seed(0)

# Define the number of transactions
num_transactions = 1000

# Generate random dates within the current year
current_year = datetime.now().year
start_date = datetime(current_year, 1, 1)
end_date = datetime.now()

# Generate a list of random dates within the year
random_dates = [start_date + timedelta(days=np.random.randint(0, (end_date - start_date).days))
                for _ in range(num_transactions)]

# Generate a list of random fee amounts
random_fees = np.random.randint(low=1, high=5000, size=num_transactions)

# Create the DataFrame
fee_transactions = pd.DataFrame({
    'date': random_dates,
    'fee': random_fees
})

# Sort by date for readability
fee_transactions.sort_values('date', inplace=True)

# Reset index after sorting
fee_transactions.reset_index(drop=True, inplace=True)

print(fee_transactions)

          date   fee
0   2024-01-01  2542
1   2024-01-01   948
2   2024-01-01  1969
3   2024-01-01  4125
4   2024-01-01   206
..         ...   ...
995 2024-07-28   735
996 2024-07-29   302
997 2024-07-29  1859
998 2024-07-29    61
999 2024-07-29  1408

[1000 rows x 2 columns]

In [15]:
pd.cut(fee_transactions.fee,
       [1,500,1000,3000,4000,5000])

0      (1000, 3000]
1       (500, 1000]
2      (1000, 3000]
3      (4000, 5000]
4          (1, 500]
           ...
995     (500, 1000]
996        (1, 500]
997    (1000, 3000]
998        (1, 500]
999    (1000, 3000]
Name: fee, Length: 1000, dtype: category
Categories (5, interval[int64, right]): [(1, 500] < (500, 1000] < (1000, 3000] < (3000, 4000] < (4000, 5000]]

In [16]:
pd.cut(fee_transactions.fee,
       [1,500,1000,3000,4000,5000]).value_counts()

fee
(1000, 3000]    427
(3000, 4000]    200
(4000, 5000]    198
(1, 500]         97
(500, 1000]      78
Name: count, dtype: int64

In [17]:
pd.cut(fee_transactions.fee,
       [1,500,1000,3000,4000,5000]).value_counts(normalize=True)*100

fee
(1000, 3000]    42.7
(3000, 4000]    20.0
(4000, 5000]    19.8
(1, 500]         9.7
(500, 1000]      7.8
Name: proportion, dtype: float64

In [18]:
pd.qcut(fee_transactions.fee, [0,0.3,.5, .7, .9, 1]).value_counts()

fee
(19.999, 1547.0]    301
(2506.0, 3536.3]    200
(3536.3, 4471.1]    200
(1547.0, 2506.0]    199
(4471.1, 4998.0]    100
Name: count, dtype: int64

In [19]:
pd.qcut(fee_transactions.fee, [0,0.3,.5, .7, .9, 1]).value_counts(normalize=True)*100
# meaning 30.1 per transaction are in 19.999 to 1547 range.

fee
(19.999, 1547.0]    30.1
(2506.0, 3536.3]    20.0
(3536.3, 4471.1]    20.0
(1547.0, 2506.0]    19.9
(4471.1, 4998.0]    10.0
Name: proportion, dtype: float64

In [21]:
students_df.head()

   roll_no   name father     course date_of_admission    fee
0        1  Alice    Bob    Physics        2023-01-10  10000
1        2  Brian  Steve  Chemistry        2023-02-12  11000
2        3  Chloe    Tim    Biology        2023-03-14  12000
3        4  David   Rick    Physics        2023-04-10  13000
4        5    Eva   John    Physics        2023-05-16  14000

## filter on columns
* & , | , ~ Syntax:
* dataframe[(dataframe.column1=='value1') & (dataframe.column2=='value2)]
* string columns
* numeric columns
* datetime columns

In [22]:
students_df.head(1)

   roll_no   name father   course date_of_admission    fee
0        1  Alice    Bob  Physics        2023-01-10  10000

In [23]:
students_df['course']=='Physics' # jaha physics mila isne true krrdia condition

0     True
1    False
2    False
3     True
4     True
5    False
6    False
7    False
8    False
9    False
Name: course, dtype: bool

In [24]:
students_df[students_df['course']=='Physics']

   roll_no   name father   course date_of_admission    fee
0        1  Alice    Bob  Physics        2023-01-10  10000
3        4  David   Rick  Physics        2023-04-10  13000
4        5    Eva   John  Physics        2023-05-16  14000

In [27]:
import pandera as pa
from pandera.typing import Series
from datetime import datetime
import pandas as pd

# Define the schema using DataFrameModel
class StudentSchema(pa.DataFrameModel):
    roll_no: Series[int] = pa.Field(ge=1)
    name: Series[str] = pa.Field(nullable=False)
    father: Series[str] = pa.Field(nullable=False)
    course: Series[str] = pa.Field(nullable=False)
    date_of_admission: Series[datetime] = pa.Field(le=datetime.now())
    fee: Series[int] = pa.Field(ge=0)

    class Config:
        coerce = True  # Automatically coerce types if possible
        strict = True  # Ensure all columns are accounted for in the schema

# Data for 10 students
students_data = [
    {'roll_no': 1, 'name': 'Alice', 'father': 'Bob', 'course': 'Physics', 'date_of_admission': '2023-01-10', 'fee': 10000},
    {'roll_no': 2, 'name': 'Brian', 'father': 'Steve', 'course': 'Chemistry', 'date_of_admission': '2023-02-12', 'fee': 11000},
    {'roll_no': 3, 'name': 'Chloe', 'father': 'Tim', 'course': 'Biology', 'date_of_admission': '2023-03-14', 'fee': 12000},
    {'roll_no': 4, 'name': 'David', 'father': 'Rick', 'course': 'physics', 'date_of_admission': '2023-04-10', 'fee': 13000},
    {'roll_no': 5, 'name': 'Eva', 'father': 'John', 'course': 'physics', 'date_of_admission': '2023-05-16', 'fee': 14000},
    {'roll_no': 6, 'name': 'Frank', 'father': 'Tom', 'course': 'Economics', 'date_of_admission': '2023-06-21', 'fee': 15000},
    {'roll_no': 7, 'name': 'Grace', 'father': 'Harry', 'course': 'History', 'date_of_admission': '2023-07-25', 'fee': 16000},
    {'roll_no': 8, 'name': 'Henry', 'father': 'Charles', 'course': 'Geography', 'date_of_admission': '2023-08-17', 'fee': 17000},
    {'roll_no': 9, 'name': 'Isabel', 'father': 'Oliver', 'course': 'English', 'date_of_admission': '2023-09-10', 'fee': 18000},
    {'roll_no': 10, 'name': 'Jack', 'father': 'Noah', 'course': 'Art', 'date_of_admission': '2023-10-05', 'fee': 19000},
]

# Create the DataFrame
students_df = pd.DataFrame(students_data)

# Convert 'date_of_admission' to datetime
students_df['date_of_admission'] = pd.to_datetime(students_df['date_of_admission'])

# Validate the DataFrame
validated_df = StudentSchema.validate(students_df)

# Print the validated DataFrame
print(validated_df)

   roll_no    name   father     course date_of_admission    fee
0        1   Alice      Bob    Physics        2023-01-10  10000
1        2   Brian    Steve  Chemistry        2023-02-12  11000
2        3   Chloe      Tim    Biology        2023-03-14  12000
3        4   David     Rick    physics        2023-04-10  13000
4        5     Eva     John    physics        2023-05-16  14000
5        6   Frank      Tom  Economics        2023-06-21  15000
6        7   Grace    Harry    History        2023-07-25  16000
7        8   Henry  Charles  Geography        2023-08-17  17000
8        9  Isabel   Oliver    English        2023-09-10  18000
9       10    Jack     Noah        Art        2023-10-05  19000

In [28]:
students_df[students_df['course']=='Physics']  # he just pick Physics not physics

   roll_no   name father   course date_of_admission    fee
0        1  Alice    Bob  Physics        2023-01-10  10000

In [30]:
students_df['course'].str.lower() == 'physics' # physics ko small alphabet me convert krke condition chalae ke physics ke equal hai ke nahe and if it is the pass true

0     True
1    False
2    False
3     True
4     True
5    False
6    False
7    False
8    False
9    False
Name: course, dtype: bool

In [31]:
students_df[students_df['course'].str.lower() == 'physics']

   roll_no   name father   course date_of_admission    fee
0        1  Alice    Bob  Physics        2023-01-10  10000
3        4  David   Rick  physics        2023-04-10  13000
4        5    Eva   John  physics        2023-05-16  14000

In [32]:
students_df['course'].str.lower().str.contains('cs') # if any course have cs word in it then pass true

0     True
1    False
2    False
3     True
4     True
5     True
6    False
7    False
8    False
9    False
Name: course, dtype: bool

In [33]:
students_df[students_df['course'].str.lower().str.contains('cs')]
# these are those words in which we have cs.

   roll_no   name father     course date_of_admission    fee
0        1  Alice    Bob    Physics        2023-01-10  10000
3        4  David   Rick    physics        2023-04-10  13000
4        5    Eva   John    physics        2023-05-16  14000
5        6  Frank    Tom  Economics        2023-06-21  15000

In [34]:
students_df[(students_df['course'].str.lower().str.contains('cs')) & (students_df['fee']>=14000)]

   roll_no   name father     course date_of_admission    fee
4        5    Eva   John    physics        2023-05-16  14000
5        6  Frank    Tom  Economics        2023-06-21  15000

In [37]:
# a word which has alphabet sc and r so we don't have any kind of word.

students_df['course'].str.lower().str.contains("cs") & students_df['course'].str.lower().str.contains("r")

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: course, dtype: bool

In [36]:
students_df['course'].str.lower().str.contains("cs") | students_df['course'].str.lower().str.contains("r")

0     True
1     True
2    False
3     True
4     True
5     True
6     True
7     True
8    False
9     True
Name: course, dtype: bool

## apply filter on date column
* dataframe.column.dt
* dt.strftime
* dt.strptime
* In pandas, when you have a datetime column in a DataFrame, you can format the date and time information using the strftime method which allows for flexible formatting by specifying format codes. Each code represents a different element of the date and time. Below are some of the commonly used format codes that you can use with strftime:

* %a - Abbreviated weekday name.
*%A - Full weekday name.
* %w - Weekday as a decimal number, where 0 is Sunday and 6 is Saturday.
* %d - Day of the month as a zero-padded decimal number.
* %b - Abbreviated month name.
* %B - Full month name.
* %m - Month as a zero-padded decimal number.
* %y - Year without century as a zero-padded decimal number.
* %Y - Year with century as a decimal number.
* %H - Hour (24-hour clock) as a zero-padded decimal number.
* %I - Hour (12-hour clock) as a zero-padded decimal number.
* %p - Locales equivalent of either AM or PM.
* %M - Minute as a zero-padded decimal number.
* %S - Second as a zero-padded decimal number.
* %f - Microsecond as a decimal number, zero-padded on the left.
* %z - UTC offset in the form HHMM[SS[.ffffff]] (empty string if the object is naive).
* %Z - Time zone name (empty string if the object is naive).
* %j - Day of the year as a zero-padded decimal number.
* %U - Week number of the year (Sunday as the first day of the week) as a zero-padded decimal number.
* %W - Week number of the year (Monday as the first day of the week) as a zero-padded decimal number.
* %c - Locales appropriate date and time representation.
* %x - Locales appropriate date representation.
* %X - Locales appropriate time representation.
* %G - ISO 8601 year with century representing the year that contains the greater part of the ISO week (%V).
* %u - ISO 8601 weekday as a decimal number where 1 is Monday.
* %V - ISO 8601 week number as a decimal number with Monday as the first day of the week.
* Here's a small example of how to use strftime with a pandas DataFrame:

import pandas as pd

#### Create a sample DataFrame with datetime column
```
df = pd.DataFrame({
    'datetime': pd.date_range(start='2023-01-01', periods=3, freq='D')
})
```
# Format the 'datetime' column as a string with a specific format
```
df['formatted_date'] = df['datetime'].dt.strftime('%Y-%m-%d %H:%M:%S')

print(df)
```
The 'formatted_date' column will contain strings representing the dates in the format specified by the strftime method. You can combine any of the symbols above to create the date format string as per your requirements.

In [38]:
students_df['date_of_admission']

0   2023-01-10
1   2023-02-12
2   2023-03-14
3   2023-04-10
4   2023-05-16
5   2023-06-21
6   2023-07-25
7   2023-08-17
8   2023-09-10
9   2023-10-05
Name: date_of_admission, dtype: datetime64[ns]

In [41]:
students_df['date_of_admission'].dt.year
# students_df['date_of_admission'].dt.month
# students_df['date_of_admission'].dt.day
# students_df['date_of_admission'].dt.weekday
# students_df['date_of_admission'].dt.day_of_week
# students_df['date_of_admission'].dt.hour
# students_df['date_of_admission'].dt.minute
# students_df['date_of_admission'].dt.second
# students_df['date_of_admission'].dt.microsecond # microseconds is not in the dataframe that's why i will give you 0

0    2023
1    2023
2    2023
3    2023
4    2023
5    2023
6    2023
7    2023
8    2023
9    2023
Name: date_of_admission, dtype: int32

In [42]:
from datetime import datetime

date : datetime = datetime.now()
date

datetime.datetime(2024, 7, 30, 21, 16, 56, 497545)

In [43]:
s1 : pd.Series = pd.Series([date])
s1

0   2024-07-30 21:16:56.497545
dtype: datetime64[ns]

In [44]:
s1.dt.strftime("%Y/%m %d %I %b %B") # convet from date to text %I means time hour   b and B. b is july and B is July

0    2024/07 30 09 Jul July
dtype: object

In [45]:
s2 :pd.Series =  pd.Series(['01 Nov 2023', '01 Nov 2024', '01 Jan 2022'])
s2

0    01 Nov 2023
1    01 Nov 2024
2    01 Jan 2022
dtype: object

In [46]:
s2.apply(lambda x: datetime.strptime(x,"%d %b %Y") ) # string to datetime

0   2023-11-01
1   2024-11-01
2   2022-01-01
dtype: datetime64[ns]

## Group by
* dataframe.groupby(['column1', 'column2'])
* dataframe.groupby(['column1', 'column2'])[['co1','col2']].aggregate([min,max])
* dataframe.groupby(['column1', 'column2'])[['co1','col2']].apply(function())

In [47]:
students_df

   roll_no    name   father     course date_of_admission    fee
0        1   Alice      Bob    Physics        2023-01-10  10000
1        2   Brian    Steve  Chemistry        2023-02-12  11000
2        3   Chloe      Tim    Biology        2023-03-14  12000
3        4   David     Rick    physics        2023-04-10  13000
4        5     Eva     John    physics        2023-05-16  14000
5        6   Frank      Tom  Economics        2023-06-21  15000
6        7   Grace    Harry    History        2023-07-25  16000
7        8   Henry  Charles  Geography        2023-08-17  17000
8        9  Isabel   Oliver    English        2023-09-10  18000
9       10    Jack     Noah        Art        2023-10-05  19000